{
  "architectures": [
    "DebertaV2ForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "finetuning_task": "text-classification",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "analysis or decision explanation",
    "1": "assisting or creative writing",
    "2": "classification",
    "3": "coding",
    "4": "editing or rewriting",
    "5": "factual information (general or professional), history or common practices",
    "6": "information extraction or summarization",
    "7": "linguistics",
    "8": "logical reasoning",
    "9": "mathematical reasoning or calculation",
    "10": "multilinguality or translation",
    "11": "other",
    "12": "recommendation",
    "13": "roleplay",
    "14": "tips, opinions or advice"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "analysis or decision explanation": 0,
    "assisting or creative writing": 1,
    "classification": 2,
    "coding": 3,
    "editing or rewriting": 4,
    "factual information (general or professional), history or common practices": 5,
    "information extraction or summarization": 6,
    "linguistics": 7,
    "logical reasoning": 8,
    "mathematical reasoning or calculation": 9,
    "multilinguality or translation": 10,
    "other": 11,
    "recommendation": 12,
    "roleplay": 13,
    "tips, opinions or advice": 14
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 1024,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "problem_type": "single_label_classification",
  "relative_attention": true,
  "share_att_key": true,
  "torch_dtype": "float32",
  "transformers_version": "4.55.2",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
